app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY "books"."title" ASC
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9)  [["book_id", 1], ["book_id", 3], ["book_id", 4], ["book_id", 9], ["book_id", 2], ["book_id", 6], ["book_id", 7], ["book_id", 8], ["book_id", 5]]
---
    def index
       book = Book.all.order(title: 'asc')
       render json: book.includes(:reviews)

INSERT INTO "books" ("id", "title", "author", "artist", "genre", "publisher", "volume", "cover_url", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
    def create
      book = Book.create!(book_params)

UPDATE "books" SET "title" = $1, "author" = $2, "artist" = $3, "genre" = $4, "updated_at" = $5 WHERE "books"."id" = $6  [["title", "52"], ["author", "Geof Johns"], ["artist", "GM"], ["genre", "Super"], ["updated_at", "2023-09-01 22:27:37.735139"], ["id", 11]]
---
    def update
         book = find_book
         book.update!(book_params)

DELETE FROM "books" WHERE "books"."id" = $1  [["id", 11]]
---
    def destroy
      book = find_book
      book.destroy

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
   def find_book
      Book.find(params[:id])