app/controllers/reviews_controller.rb

    def index
        review = Review.all
---
SELECT "reviews".* FROM "reviews"

    def create
        book = find_book
        review = book.reviews.create(review_params)
---
INSERT INTO "reviews" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", "Not Bad!"], ["user_id", 2], ["book_id", 9], ["created_at", "2023-09-05 19:26:42.222000"], ["updated_at", "2023-09-10 14:36:09.364776"]]

    def update
        review = find_review
        review.update(review_params)
---
UPDATE "reviews" SET "comment" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["comment", "What a ride"], ["updated_at", "2023-09-10 14:44:41.211890"], ["id", 8]]

    def find_book
        Book.find(params[:book_id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

    def find_review
        Book.find(params[:book_id]).reviews.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = $1 AND "reviews"."id" = $2 LIMIT $3  [["book_id", 9], ["id", 8], ["LIMIT", 1]]