app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        user = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
        user = User.find_by(id: session[:user_id])

INSERT INTO "users" ("first_name", "last_name", "username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        user = User.create!(user_params)